---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.HandRailType
source: html/6540475f-cdb5-a332-6116-73e3f08aff1d.htm
---
# HandRailType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.